hey.log

Summary:
  Total:	247.4598 secs
  Slowest:	19.9420 secs
  Fastest:	0.0013 secs
  Average:	0.0223 secs
  Requests/sec:	404.1060
  

Response time histogram:
  0.001 [1]	|
  1.995 [99905]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.989 [23]	|
  5.984 [0]	|
  7.978 [16]	|
  9.972 [0]	|
  11.966 [0]	|
  13.960 [0]	|
  15.954 [1]	|
  17.948 [0]	|
  19.942 [50]	|


Latency distribution:
  10% in 0.0058 secs
  25% in 0.0095 secs
  50% in 0.0107 secs
  75% in 0.0114 secs
  90% in 0.0123 secs
  95% in 0.0130 secs
  99% in 0.0203 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0126 secs, 0.0013 secs, 19.9420 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.0118 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0097 secs, 0.0007 secs, 0.3215 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0046 secs

Status code distribution:
  [200]	99996 responses

Error distribution:
  [4]	Get "http://localhost:8000/test/index.txt": context deadline exceeded (Client.Timeout exceeded while awaiting headers)