hey.log

Summary:
  Total:	468.0448 secs
  Slowest:	0.4322 secs
  Fastest:	0.0011 secs
  Average:	0.0643 secs
  Requests/sec:	155.3847
  

Response time histogram:
  0.001 [1]	|
  0.044 [58735]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.087 [8]	|
  0.130 [2]	|
  0.174 [0]	|
  0.217 [0]	|
  0.260 [0]	|
  0.303 [740]	|■
  0.346 [13189]	|■■■■■■■■■
  0.389 [39]	|
  0.432 [13]	|


Latency distribution:
  10% in 0.0051 secs
  25% in 0.0054 secs
  50% in 0.0060 secs
  75% in 0.0081 secs
  90% in 0.3075 secs
  95% in 0.3103 secs
  99% in 0.3147 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0587 secs, 0.0011 secs, 0.4322 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.0257 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0074 secs
  resp wait:	0.0056 secs, 0.0005 secs, 0.1307 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [200]	72727 responses